Repository: origam/origam
Catalog: backend/Origam.Workflow/Strings.*.resx
Languages: de

# ErrorsInForm
source: Form contains errors (empty mandatory fields). Correct the errors before executing the action.
de: Formular enthält Fehler (leere Pflichtfelder). Beheben Sie die Fehler, bevor Sie die Aktion ausführen.

# ErorrMessage
source: Error occured while executing '{0}' in form '{1}'
de: Fehler beim Ausführen von '{0}' im Formular '{1}'

# ErrorNotString
source: Data is not of type string
de: Daten sind nicht vom Typ String

# ErrorNotBlob
source: Data is not of type Blob
de: Daten sind nicht vom Typ Blob

# ErrorUserCanceled
source: Task cancelled by the user.
de: Arbeitsschritt abgebrochen durch den Anwender.

# ErrorNoRecords
source: Could not execute the requested command. No records available.
de: Angeforderter Befehl konnte nicht ausgeführt werden. Keine Datensätze verfügbar.

# OKMessage
source: OK; {0} items.
de: OK; {0} Elemente.

# ErrorMessage
source: Error: {0}
de: Fehler: {0}

# ErrorStepFailed
source: Failed executing task '{0}'{1}
de: Ausführung des Arbeitsschrittes '{0}'{1} fehlgeschlagen

# ErrorChangeState
source: {0} of '{1}' cannot enter the state '{2}'. Current state: '{3}'.
de: Aktueller {0} ist '{3}'. Ein Wechsel zu {0} '{2}' ist nicht möglich.

# ErrorStateMachineNotFound
source: State machine not found. Cannot execute events.
de: Zustandsmaschine nicht gefunden. Ereignisse können nicht ausgeführt werden.

# ErrorsInForm1
source: Form contains errors (some mandatory fields are empty). After correcting the data you can repeat the requested action.
de: Formular enthält Fehler (einige Pflichtfelder sind leer). Nach der Korrektur der Daten können Sie die gewünschte Aktion wiederholen.

# ProcessFinished
source: Taskflow Finished
de: Arbeitsschritt beendet

# ErrorRecordsLockedAlready
source: Items are locked by another process. Cannot process queue items.
de: Elemente werden durch einen anderen Prozess belegt. Elemente in der Warteschlange können nicht verarbeitet werden.

# ErrorWorkQueueNotFoundByReferenceCode
source: Work queue with code {0} was not found.
de: Keine Work queue mit Code {0} gefunden.

# ErrorEmailNotString
source: Email is not of type string
de: E-Mail ist kein String

# ErrorPasswordAnswerNotString
source: PasswordAnswer not of type string
de: PasswordAnswer ist kein String

# ErrorPasswordQuestionNotString
source: PasswordQuestion is not of type string
de: PasswordQuestion ist kein String

# ErrorProviderUserKeyNotGuid
source: ProviderUserKey is not of type guid
de: ProviderUserKey ist nicht vom Typ guid

# ErrorUsernameNotString
source: Username is not of type string
de: Username ist kein String

# ErrorNoRecordsSelectedForAction
source: No records selected. Cannot execute action.
de: Keine Datensätze ausgewählt. Aktion kann nicht ausgeführt werden.

# ErrorParsingConnectionString
source: An error has occurred while parsing the connection string
de: Beim Parsen der Verbindungszeichenfolge ist ein Fehler aufgetreten.

# UnknownReadType
source: Unknown ReadType value.
de: Unbekannter ReadType-Wert.

source: Archive entry too large.
de: Archiv-Eintrag ist zu groß.

# ArchiveEntrySuspiciousCompressionRatio
source: Archive entry has suspicious compression ratio.
de: Archiv-Eintrag hat ein verdächtiges Kompressionsverhältnis.

# StreamExceedsAllowedSize
source: File exceeds allowed size.
de: Datei überschreitet die zulässige Größe.

# EntryNotFoundInArchive
source: Entry '{0}' not found in archive '{1}'.
de: Eintrag '{0}' wurde im Archiv '{1}' nicht gefunden.

# EntryOutsideTargetDir
source: Entry is outside the target dir: {0}
de: Eintrag liegt außerhalb des Zielverzeichnisses: {0}
