Repository: origam/origam
Catalog: backend/Origam.Workbench.Services/Strings.*.resx
Languages: de

# ErrorGetLookupText
source: Failed getting lookup text for lookup: {0}
de: Lookup-Text für Lookup nicht verfügbar: {0}

# ErrorUpdateRunning
source: Update is already running. Cannot start update.
de: Aktualisierung läuft bereits. Aktualisierung kann nicht gestartet werden.

# ErrorUpdateFailed
source: Update failed.
de: Aktualisierung fehlgeschlagen.

# Loading
source: Loading {0}...
de: Lade {0}...

# ErrorDifferentPackage
source: The imported model contains different package than the current model. Cannot import model.
de: Das importierte Modell enthält andere Pakete als das aktuelle Modell. Das Modell kann nicht importiert werden.

# ErrorOlderModel
source: The model being imported is older than the current model. Cannot import model.
de: Das zu importierende Modell ist älter als das aktuelle. Das Modell wird nicht importiert.

# DeploymentDeadlockHeader
source: Deployment version order could not be determined, because circular dependencies were detected among some deployment versions. Successfully ordered deployment versions: {0} The sorting process failed with these deployment versions as the next step candidates: {1}
de: Die Reihenfolge der Deployment-Versionen konnte nicht ermittelt werden, da zirkuläre Abhängigkeiten zwischen einigen Deployment-Versionen festgestellt wurden. Erfolgreich sortierte Deployment-Versionen: {0} Der Sortiervorgang ist bei diesen Deployment-Versionen als Kandidaten für den nächsten Schritt fehlgeschlagen: {1}

# DeploymentDeadlockPrereqConflicts
source: The following deployments would not be able to run later because they depend on other deployments from the current step.That is why the sorting cannot progress any further. {0}
de: Die folgenden Deployments könnten später nicht ausgeführt werden, weil sie von anderen Deployments aus dem aktuellen Schritt abhängen. Daher kann der Sortiervorgang nicht fortgesetzt werden. {0}

# DeploymentDeadlockCandidateFormat
source: Candidate: {0} {1} Dependencies: {2}
de: Kandidat: {0} {1} Abhängigkeiten: {2}

# DeploymentDeadlockBlockerFormat
source: Blocker: {0} {1} Dependencies: {2}
de: Blocker: {0} {1} Abhängigkeiten: {2}
