Repository: origam/origam
Catalog: backend/Origam.Server/Resources/Resources.*.resx
Languages: cs_cz, de

# BlobFileNotAvailable
source: File is not available.
cs_cz: Soubor již není k dispozici.
de: Datei ist nicht verfügbar.

# BlobMaxSizeError
source: Maximum file size exceeded ({0} kB).
cs_cz: Byla přesažena maximální velikost přílohy {0} kB.
de: Maximale Dateigrösse hat ({0} kB) überschritten.

# BlobNoFileSelected
source: No file was selected.
cs_cz: Nebyl vybrán žádný soubor.
de: Keine Datei ausgewählt.

# BlobTooManyFilesSelected
source: You cannot select more than 1 file.
cs_cz: Není možné vybrat více než 1 soubor.
de: Sie können nicht mehr als 1 Datei auswählen.

# DefaultTooltipNoChange
source: Record has not been changed yet.
cs_cz: Záznam nebyl aktualizován.
de: Datensatz wurde noch nicht verändert.

# DefaultTooltipRecordCreated
source: Created by <b>{0}</b> on <b>{1}</b>
cs_cz: Vytvořil <b>{0}</b> dne <b>{1}</b>
de: Erstellt von <b>{0}</b> am <b>{1}</b>

# DefaultTooltipRecordUpdated
source: Last updated by <b>{0}</b> on <b>{1}</b>
cs_cz: Naposledy aktualizoval <b>{0}</b> dne <b>{1}</b>
de: Letztes Update von <b>{0}</b> am <b>{1}</b>

# ErrorAttachmentMaximumSize
source: Maximum attachment size exceeded ({0} bytes).
cs_cz: Byla přesažena maximální velikost přílohy ({0} bytů).
de: Maximale Grösse des Anhangs hat ({0} bytes) überschritten.

# ErrorAttachmentNoFile
source: Error occured while uploading attachment: No file provided.
cs_cz: Nastala chyba při ukládání přílohy: Nebyl poskytnut soubor.
de: Fehler beim Laden des Anhangs: Keine Datei angegeben.

# ErrorAttachmentNotAvailable
source: Attachment not available.
cs_cz: Příloha již není k dispozici.
de: Anhang nicht verfügbar.

# ErrorAttachmentNotFoundInDb
source: Attachment not available in the database.
cs_cz: Příloha nebyla v databázi nalezena.
de: Anhang nicht verfügbar in der Datenbank.

# ErrorAttachmentNotFullyReceived
source: Attachment not fully received.
cs_cz: Příloha nebyla řádně přijata.
de: Anhang nicht vollständig erhalten.

# ErrorAttachmentRetrieval
source: Error occured while retrieving the attachment.
cs_cz: Nastala chyba při načítání přílohy.
de: Fehler beim Aufrufen des Anhangs.

# ErrorBlobRecordEmpty
source: Record empty, cannot download file.
cs_cz: Záznam je prázdný, není možné uložit soubor.
de: Leerer Datensatz, Datei kann nicht heruntergeladen werden.

# ErrorChangeUIMultipleRecords
source: Selecting multiple records for ChangeUI is not supported.
cs_cz: Pro metodu ChangeUI není podporováno označení více záznamů.
de: Auswahl mehrerer Datensätze für ChangeUI wird nicht unterstützt.

# ErrorCommandInProgress
source: The data are being processed by another request. Please wait until the previous request is finished and then repeat the action.
cs_cz: Data jsou nyní zpracovávána předchozím požadavkem. Vyčkejte dokončení předchozího požadavku a opakujte akci znovu.
de: Die Daten werden von einer anderen Anfrage bearbeitet. Bitte warten Sie, bis die vorherige Anfrage beendet ist und wiederholen Sie die Aktion.

# ErrorContextUnknownAction
source: Unknown action.
cs_cz: Neznámý povel.
de: Unbekannte Aktion.

# ErrorDashboardViewNotFound
source: Dashboard view not found.
cs_cz: Nebyl nalezen dashboard pohled.
de: Dashboard Ansicht nicht gefunden.

# ErrorExportNotAvailable
source: Export no longer available.
cs_cz: Export již není k dispozici.
de: Export nicht mehr verfügbar.

# ErrorFormNotSavedBeforeAction
source: You have to save the form's data before executing the current action.
cs_cz: Před provedením této akce je potřeba uložit data ve formuláři.
de: Sie müssen die Formulareinträge speichern, bevor Sie die aktuelle Aktion ausführen.

# ErrorInForm
source: Form data contain errors (some mandatory fields are empty). Correct these errors before proceding.
cs_cz: Data formuláře obsahují chyby. Nejdříve chyby opravte a pak pokračujte.
de: Formulareintrag enthält Fehler (einige Plichtfelder sind leer). Beheben Sie diese Fehler, bevor Sie weiterfahren.

# ErrorLoadingWorkQueueList
source: Could not load work queue list.
cs_cz: Nastala chyba při načítání seznamu front zpráv.
de: Liste der Auftäge in der Warteschlange konnte nicht geladen werden.

# ErrorLogOut
source: Session not available. Cannot log out.
cs_cz: Relace nenalezena. Není možné se odhlásit.
de: Sitzung nicht verfügbar. Ausloggen nicht möglich.

# ErrorMultipleRecordsParameters
source: Unsupported mode. Cannot pass parameters for multiple record selection.
cs_cz: Nepodporovaný mód. Pro označení více záznamů není možné předávat parametry.
de: Modus wird nicht unterstützt. Parameter für das Auswählen von mehreren Datensätzen können nicht weitergereicht werden.

# ErrorNoRecordsSelectedForAction
source: No records selected. Cannot execute action.
cs_cz: Nebyly vybrány žádné záznamy, není možné spustit požadovaný povel.
de: Keine Datensätze ausgewählt. Aktion kann nicht ausgeführt werden.

# ErrorOpenFormMultipleRecords
source: Selecting multiple records for OpenForm is not supported.
cs_cz: Pro metodu OpenForm není podporováno označení více záznamů.
de: Auswahl mehrerer Datensätze für OpenForm wir nicht unterstützt.

# ErrorRecordNotFound
source: Data row not found by the provided ID.
cs_cz: Záznam nenalezen.
de: Tabellenzeile wird von der mitgelieferten ID nicht gefunden.

# ErrorRefreshReturnInvalid
source: Invalid data returned by {0} for action {1}.
cs_cz: {0} vrátil neplatná data pro akci {1}.
de: Ungültige Datenstruktur von {0} zurückgegeben für Aktion {1}.

# ErrorReportActionMultipleRecords
source: Selecting multiple records for ReportAction is not supported.
cs_cz: Pro výstupní sestavy není podporováno označení více záznamů.
de: Auswahl mehrerer Datensätze für ReportAction wird nicht unterstützt.

# ErrorReportNotAvailable
source: Report no longer available.
cs_cz: Sestava již není k dispozici.
de: Protokoll nicht mehr verfügbar.

# ErrorReportOpenFormMultipleRecords
source: Selecting multiple records for OpenForm/Report is not supported.
cs_cz: Pro metodu Report/OpenForm není podporováno označení více záznamů.
de: Auswahl mehrerer Datensätze für OpenForm/Report wird nicht unterstützt.

# ErrorSessionExpired
source: Your connection expired or the application has been restarted. Please refresh your browser or log in again.
cs_cz: Vaše připojení bylo ukončeno z důvodu nečinnosti nebo z důvodu restartování aplikace. Obnovte, prosím, svůj prohlížeč nebo se znovu přihlašte.
de: Ihre Verbindung ist abgelaufen oder die Anwendung wurde neu gestartet. Bitte aktualisieren Sie Ihren Browser oder melden Sie sich erneut an.

# ErrorSessionNotFound
source: Session not found: {0}
cs_cz: Nebyla nalezena relace: {0}
de: Sitzung nicht gefunden: {0}

# ErrorUnknownPageType
source: Unknown page type.
cs_cz: Neznámý druh stránky.
de: Unbekannter Seitentyp.

# ErrorUnknownRowChangeState
source: Unknown row change state.
cs_cz: Neznámý RowChangeState
de: Unbekannter Zeilenänderungszustand.

# ErrorUnknownSessionType
source: Could not resolve session type.
cs_cz: Neznámý druh relace.
de: Sitzungstyp konnte nicht aufgelöst werden.

# ErrorUnknownWorkflowPageAction
source: Unknown WorkflowPage action.
cs_cz: Neznámý druh akce WorkflowPage.
de: Unbekannte WorkflowPage-Aktion.

# ErrorUnknownWorkQueueCommandValueType
source: Unknown work queue command value type.
cs_cz: Neznámý druh hodnoty příkazu fronty zpráv.
de: Unbekannter Befehlwerttyp in der Arbeitswarteschlange.

# ErrorUnsupportedMenuItemType
source: Unsupported menu item type.
cs_cz: Druh položky menu není podporován.
de: Nicht unterstützter Menüelementtyp

# ErrorWorkflowSessionInvalid
source: Workflow session invalid.
cs_cz: Neexistující relace.
de: Workflow-Sitzung ungültig

# ErrorWorkQueueCommandNotFound
source: Command not found.
cs_cz: Příkaz nenalezen.
de: Befehl nicht gefunden.

# ExportLimitExceeded
source: Number of records exported exceeded the limit set by the administrator.
cs_cz: Počet exportovaných záznamů přesáhl limit nastavený administrátorem.
de: Anzahl der exportierten Dateien hat die vom Administrator gesetzte Limite überschritten.

# WorkflowErrorTitle
source: Taskflow Error
cs_cz: Chyba průvodce
de: Fehler im Arbeitsablauf

# WorkflowFinished
source: Taskflow has finished succesfully
cs_cz: Průvodce byl úspěšně dokončen.
de: Arbeitsfluss wurde erfolgreich beendet

# WorkflowFinishedTitle
source: Taskflow Finished
cs_cz: Průvodce dokončen
de: Ende des Arbeitsflusses

# WorkQueueTitle
source: Work Queue
cs_cz: Fronta zpráv
de: Arbeitsvorrat

# ErrorCannotRefreshFormNotSaved
source: Form not saved. It is not possible to refresh data that were not saved first.
cs_cz: Data nejsou uložena. Není možné obnovit záznam, který ještě nebyl uložen.
de: Eingabe nicht gespeichert. Nicht gespeicherte Daten können nicht aktualisert werden.

# ErrorDataNotSavedWhileChangingRow
source: Critical Error: Data were not saved while changing the actual row. Data would be in an inconsistent state. Please reload browser and try the action again.
cs_cz: Kritická chyba: Data nejsou uložena ale došlo ke změně záznamu. Data formuláře nejsou v konzistentním stavu. Obnovte, prosím, prohlížeč a zkuste akci opakovat.
de: Kritischer Fehler: Daten wurden während dem Ändern der aktuellen Zeile nicht gespeichert. Daten würden dadurch inkonsistent. Bitte Seite neu laden und nochmals versuchen.

# ErrorTreeHasChildrenCannotDelete
source: The node cannot be deleted. Delete all sub-ordinate nodes first.
cs_cz: Položka nemůže být vymazána. Vymažte nejdříve všechny podřízené položky.
de: Der Knoten kann nicht gelöscht werden. Bitte vorgängig alle Unterknoten löschen.

# ErrorTreeItemUsedCannotDelete
source: The node cannot be deleted because it is used by other data.
cs_cz: Není možné vymazat položku, protože je již použita v jiných datech.
de: Der Knoten kann nicht gelöscht werden, da er von anderen Daten verwendet wird.

# ErrorCreateRecordNotAllowed
source: You are not allowed to create new records.
cs_cz: Nemáte oprávnění přidávat nové záznamy.
de: Fehlende Berechtigung zum Anlegen neuer Datensätze.

# ErrorTooManyTabsOpen
source: Too many screens are open. You have to close some tabs before opening new screens.
cs_cz: Je otevřeno příliš mnoho obrazovek. Před otevřením nové obrazovky zavřete některé záložky.
de: Zu viele Fenster geöffnet. Bitte schliessen Sie unbenötigte Reiter vor dem Öffnen neuer Fenster.

# MenuNotAuthorized
source: You don't have access to {0}
cs_cz: Nemáte přístup k menu {0}
de: Sie haben keinen Zugriff auf {0}

# ErrorCannotOpenFormExclusively
source: Cannot open '{0}' while editing other data. Please close all screens first.
cs_cz: '{0}' nelze otevřít protože jsou rozeditována jiná data. Nejprve prosím zavřete ostatní obrazovky.
de: '{0}' kann nicht geöffnet werden, während andere Daten bearbeitet werden. Bitte schließen Sie zuerst alle Bildschirme.

# ErrorCannotOpenScreenWhenExclusiveIsOpen
source: Close '{0}' before opening new screens.
cs_cz: Zavřete '{0}', než otevřete nové obrazovky.
de: Schließen Sie '{0}', bevor Sie neue Bildschirme öffnen.

# ErrorColumnNotFound
source: Trying to access column `{0}', but it is not present in a dataset.
cs_cz: Pokoušíte se přistupovat ke sloupci {0}, ale ten v datasetu není přítomen.
de: Versuch, auf die im Datenset nicht vorhandene Reihe `{0}' zuzugreifen.

# ErrorDependentColumnNotFound
source: Couldn't update dependent column `{0}' on column `{1}' at entity `{2}', ({3})
cs_cz: Nepodařilo se aktualizovat závislý sloupec {0} u sloupce {1} v entitě {2}, ({3})
de: Zeile `{0}' abhängig von Zeile `{1}' bei Entität `{2}', ({3}) konnte nicht aktualisiert werden.

# ErrorPseudoparameterBodyNotDefined
source: Pseudoparameter 'body' not defined as a parametr of a API data page but attempted to use during PUT call.
cs_cz: Pseudoparametr 'body' nebyl definován jako parametr datové stránky API, ale byl použit během volání PUT.
de: Pseudoparameter 'body' ist nicht als Paramter einer API Datenseite definiert, wurde aber in einem PUT Call verwendet.

# ErrorNoGetByIdFilterSet
source: Data structure filter set with name GetById was not found under WorkQueueStructure {0}.
cs_cz: Datová struktura {0} neobsahuje filtrovou sadu GetById.
de: Datenstruktur-Filterset mit dem Namen GetById wurde unter WorkQueueStructure {0} nicht gefunden.

# ErrorWorkQueueClassNotFound
source: Work Queue Class for work queue with id {0} not found.
cs_cz: Pro frontu id {0} nebyla nalezena odpovídající třída.
de: Arbeitswarteschlangenklasse für Warteschlange mit der ID {0} nicht gefunden.

# ErrorSpecifiedCustomWorkQueueScreenNotFound
source: Custom Work Queue Screen {0} not found.
cs_cz: Nenalezena požadovaná frontová obrazovka {0}.
de: Benutzerdefinierter Arbeitswarteschlangenbildschirm {0} wurde nicht gefunden.

# GeneralErrorMessage
source: An error has occurred. There may be some details in the log file.
cs_cz: Došlo k chybě. V log souboru mohou být uvedeny podrobnosti.
de: Ein Fehler ist aufgetreten. In der Protokolldatei befinden sich möglicherweise weitere Details.

# ErrorDiscoveryDocumentRetrieval
source: Error while retrieving discovery document from '{0}': {1} {2} - {3}
cs_cz: Chyba při stahování discovery dokumentu z '{0}': {1} {2} - {3}
de: Fehler beim Abrufen des Discovery-Dokuments von '{0}': {1} {2} - {3}

# ErrorTokenEndpointNotFoundInDiscovery
source: token_endpoint was not found in discovery document from '{0}'.
cs_cz: token_endpoint nebyl nalezen v discovery dokumentu z '{0}'.
de: token_endpoint wurde im Discovery-Dokument von '{0}' nicht gefunden.

# ErrorDiscoveryDocumentParseFailed
source: Failed to parse discovery document from '{0}'.
cs_cz: Nepodařilo se zpracovat discovery dokument z '{0}'.
de: Discovery-Dokument von '{0}' konnte nicht geparst werden.

# ErrorTokenEndpointNullOrEmpty
source: token_endpoint in discovery document from '{0}' is null or empty.
cs_cz: token_endpoint v discovery dokumentu z '{0}' je prázdný.
de: token_endpoint im Discovery-Dokument von '{0}' ist leer.

# ErrorPasswordTokenRequest
source: Error while requesting password token from '{0}': {1} {2} - {3}
cs_cz: Chyba při požadavku na bezpečnostní token z '{0}': {1} {2} - {3}
de: Fehler bei der Anforderung des Passwort-Tokens von '{0}': {1} {2} - {3}

# ErrorAccessTokenNotFoundInResponse
source: access_token was not found in response from '{0}'.
cs_cz: access_token nebyl nalezen v odpovědi ze serveru '{0}'.
de: access_token wurde in der Antwort von '{0}' nicht gefunden.

# ErrorAccessTokenNullOrEmpty
source: access_token in token response is null or empty.
cs_cz: access_token v odpovědi je prázdný.
de: access_token in der Token-Antwort ist leer.

# ErrorExpiresInParseNumber
source: Cannot parse numeric expires_in value "{0}" to integer.
cs_cz: Nelze převést číselnou hodnotu expires_in "{0}" na celé číslo.
de: Numerischer Wert von expires_in "{0}" kann nicht in eine ganze Zahl konvertiert werden.

# ErrorExpiresInParseString
source: Cannot parse string expires_in value "{0}" to integer.
cs_cz: Nelze převést textovou hodnotu expires_in "{0}" na celé číslo.
de: Zeichenfolgenwert von expires_in "{0}" kann nicht in eine ganze Zahl konvertiert werden.

# ErrorTokenResponseParseFailed
source: Failed to parse token response from '{0}'. Raw content: {1}
cs_cz: Nepodařilo se zpracovat odpověď s tokenem z '{0}'. Původní obsah: {1}
de: Token-Antwort von '{0}' konnte nicht geparst werden. Rohinhalt: {1}
