Repository: origam/origam
Catalog: backend/Origam.Server/Resources/SharedResources.*.resx
Languages: cs_cz, de

# ErrorRefreshReturnInvalid
source: Invalid data returned by {0} for action {1}.
cs_cz: Neplatná data vrácená od {0} pro akci {1}.

# ErrorReportNotAvailable
source: Report no longer available.
cs_cz: Report již není k dispozici.

# ErrorBlobNotAvailable
source: BLOB no longer available.
cs_cz: BLOB již není k dispozici.

# ErrorBlobMemberBlobLookupNotSpecified
source: Both BlobMember and BlobLookupId are not specified. Cannot download blob.
cs_cz: Ani BlobMember, ani BlobLookupId nejsou specifikovány. Nelze stáhnout blob.

# ErrorBlobNotBlob
source: Data source returned data that is not BLOB.
cs_cz: Datový zdroj vrátil data, která nejsou BLOB.

# ErrorBlobRecordEmpty
source: Record empty, cannot download file.
cs_cz: Záznam je prázdný, soubor nelze stáhnout.

# ErrorBlobFileNotAvailable
source: File is not available.
cs_cz: Soubor není k dispozici.

# ErrorWorkflowSessionInvalid
source: Workflow session invalid.
cs_cz: Relace workflow je neplatná.

# FilePathPartParameterNull
source: File path part is to be replaced by a parameter value but the value provided is NULL. Cannot construct file path.
cs_cz: Část cesty k souboru má být nahrazena hodnotou parametru, ale poskytnutá hodnota je NULL. Nelze vytvořit cestu k souboru.

# ErrorLoadingWorkQueueList
source: Could not load work queue list.
cs_cz: Nepodařilo se načíst seznam fronty úloh.

# DefaultTooltipNoChange
source: Record has not been changed yet.
cs_cz: Záznam ještě nebyl změněn.

# DefaultTooltipRecordCreated
source: Created by <b>{0}</b> on <b>{1}</b>
cs_cz: Vytvořil(a) <b>{0}</b> dne <b>{1}</b>

# DefaultTooltipRecordUpdated
source: Last updated by <b>{0}</b> on <b>{1}</b>
cs_cz: Naposledy změněno <b>{0}</b> dne <b>{1}</b>

# RegistrationNotAllowed
source: User registration is not allowed on this site.
cs_cz: Registrace na této stránce není povolena.
de: Die Registration ist auf dieser Seite nicht erlaubt.

# AlreadySetUp
source: The application has already been set up.
cs_cz: Aplikace již byla nastavena.
de: Die Applikation wurde schon installiert.

# InvalidLogin
source: Invalid username or password
cs_cz: Nesprávné jméno nebo heslo
de: Ungültiger Benutzername oder Passwort

# UserLockedOut
source: User is locked out
cs_cz: Uživateli byl zablokován přístup.
de: Der Benutzer ist gesperrt.

# ErrorUserNotFound
source: User was not found
cs_cz: Uživatel nebyl nalezen.
de: Der Benutzer wurde nicht gefunden.

# EmailInvalid
source: Email is invalid
cs_cz: Nesprávný e-mail
de: Ungültige E-Mail-Adresse

# StringTooShort
source: The {0} must be at least {2} characters long.
cs_cz: {0} musí mít nejméně {2} znaků.
de: {0} muss mindestens {2} Zeichen lang sein.

# AccountCreated
source: New account has been created and activated.
cs_cz: Nový účet byl vytvořen a aktivován.
de: Neues Konto wurde erstellt und aktiviert.

# ActivateAccount
source: A new account has been created. Please click the confirmation link in the email we just sent you to activate the account.
cs_cz: Nový účet byl vytvořen. Pro aktivaci účtu prosím klikněte na potvrzovací link, který jsme Vám právě odeslali na e-mail.
de: Neues Konto wurde erstellt. Bitte klicken Sie den Link in Ihrer E-Mail um Ihr Konto zu aktivieren.

source: Cancel
cs_cz: Zrušit
de: Stornieren

# CheckEmail
source: Please check your email to reset your password.
cs_cz: Pro resetování hesla postupujte podle instrukcí, které jsme Vám odeslali na e-mail.
de: Bitte überprüfen Sie Ihr E-Mail-Postfach, um Ihr Passwort zurückzusetzen.

# ConfirmLogout
source: Would you like to logout?
cs_cz: Chcete se odhlásit?
de: Möchten Sie sich abmelden?

source: Create
cs_cz: Vytvořit
de: Erstellen

# CreateAccount
source: Create a new account
cs_cz: Vytvořit nový účet
de: Neues Konto erstellen

# EmailSent
source: Please click the confirmation link in the email we sent you to activate your account.
cs_cz: Pro aktivaci účtu prosím klikněte na potvrzovací link, který jsme Vám právě odeslali na e-mail.
de: Bitte klicken Sie den Link in Ihrer E-Mail um Ihr Konto zu aktivieren.

# IdentityServerTitle
source: {0} Login
cs_cz: {0} přihlášení
de: {0} Anmelden

source: Invalid login request
cs_cz: Nesprávný přihlašovací požadavek
de: Ungültige Anmeldeanforderung

source: Local Login
cs_cz: Lokální přihlášení
de: Lokal anmelden

# LoggedOut
source: You are now logged out.
cs_cz: Odhlášení proběhlo úspěšně.
de: Sie sind jetzt abgemeldet.

source: Log In
cs_cz: Přihlásit
de: Anmelden

source: Log Out
cs_cz: Odhlásit
de: Abmelden

# NoAccessToResource
source: You do not have access to that resource.
cs_cz: Sem nemáte povolený přístup.
de: Sie haben kein Zutritt zu diesem Mittel.

# NoLoginSchemes
source: There are no log in schemes configured for this client.
cs_cz: Není nastaven žádný způsob přihlášení.
de: Keine Anmeldeschemen erstellt für diesen Kunden.

# RememberLogin
source: Remember my Login
cs_cz: Zapamatovat přihlášení
de: Meine Anmeldung speichern

source: Reset Password
cs_cz: Resetovat heslo
de: Passwort zurücksetzen

# ResetPasswordTitle
source: Reset your password
cs_cz: Reset hesla
de: Setzen Sie ein neues Passwort

source: Submit
cs_cz: Odeslat
de: Anfordern

source: Yes
cs_cz: Ano
de: Ja

# ReturnToApplication1
source: Click
cs_cz: Klikněte
de: Klicken Sie

# ReturnToApplication2
source: here
cs_cz: sem
de: hier

# ReturnToApplication3
source: to return to
cs_cz: pro návrat do
de: um zu der Applikation

# ToLogin1
source: Click
cs_cz: Pro opětovné přihlášení klikněte
de: Klicken Sie

# ToLogin2
source: here
cs_cz: sem
de: hier

# ToResetPassword1
source: Click
cs_cz: Pro reset hesla klikněte
de: Klicken Sie

# ToResetPassword2
source: here
cs_cz: sem
de: hier

# ToInitialUser1
source: Click
cs_cz: Pro vytvoření nového uživatele klikněte
de: Klicken Sie

# ToInitialUser2
source: here
cs_cz: sem
de: hier

source: Username
cs_cz: Uživatel
de: Benutzername

source: Name
cs_cz: Příjmení

source: First Name
cs_cz: Jméno
de: Vorname

source: Confirm Password
cs_cz: Potvrzení hesla
de: Passwort bestätigen

source: Password
cs_cz: Heslo
de: Passwort

source: External Login
cs_cz: Externí přihlášení
de: Extern Anmelden

# ResetPasswordConfirmation1
source: Your password was reset. Please click
cs_cz: Vaše heslo bylo resetováno. Pro přihlášení klikněte
de: Ihr Passwort wurde zurückgesetzt. Bitte klicken Sie

# ResetPasswordConfirmation2
source: here
cs_cz: sem
de: hier

# EmailConfirmation1
source: Thank you for confirming your email. Please click
cs_cz: Váš e-mail byl potvrzen. Pro přihlášení klikněte
de: Danke für die Bestätigung Ihrer E-Mail Adresse. Bitte klicken Sie

# EmailConfirmation2
source: here
cs_cz: sem
de: hier

source: Two Factor Authentication
cs_cz: Dvoufaktorové přihlášení
de: Zwei-Faktor-Authentifizierung

# EnterAuthenticationCode
source: Please enter the authentication code we sent to your email.
cs_cz: Sem opište autorizační kód, který jsme odeslali na Váš e-mail.
de: Bitte geben Sie den Passcode ein, den wir auf Ihre E-Mail Adresse gesandt haben.

# LoginFailedUnknown
source: Login Failed
cs_cz: Přihlášení se nezdařilo.
de: Die Anmeldung ist fehlgeschlagen.

# LoginFailedWrongCode
source: Login Failed. Check the code please.
cs_cz: Přihlášení se nezdařilo. Zkontrolujte prosím kód.
de: Die Anmeldung ist fehlgeschlagen. Bitte überprüfen Sie den Passcode.

# UnknownError
source: An unexpected error has occured. Please contact support.
cs_cz: Objevila se neočekávaná chyba. Kontaktujte prosím podporu.
de: Ein unerwarteter Fehler ist aufgetreten. Bitte kontaktieren Sie den Support.

# EmailIsInvalid
source: Email {0} is invalid.
cs_cz: Email {0} není platný.
de: E-Mail-Adresse {0} ist ungültig.

# EmailTaken
source: Email {0} is already taken.
cs_cz: Email {0} už má někdo jiný.
de: E-Mail-Adresse {0} wird bereits verwendet.

source: Incorrect password.
cs_cz: Nesprávné heslo
de: Falsches Passwort

source: Invalid token.
cs_cz: Neplatný token
de: Ungültiger Token

# LockOutNotEnabled
source: Lockout is not enabled for this user.
cs_cz: Uzamčení není pro tohoto uživatele povoleno.
de: Die Sperrung ist für diesen Benutzer nicht aktiviert.

# LoginExists
source: A user with this login already exists.
cs_cz: Toto uživatelské jméno už používá někdo jiný.
de: Ein Benutzer mit diesem Login existiert bereits.

# MustBeNonAlphaNumeric
source: Passwords must have at least one non alphanumeric character.
cs_cz: Heslo musí obsahovat alespoň jeden znak, který není číslo ani písmeno.
de: Das Passwort muss mindestens ein nicht alphanumerisches Zeichen enthalten.

# MustContainDigit
source: Passwords must have at least one digit ('0'-'9').
cs_cz: Heslo musí obsahovat alespoň jedno číslo ('0'-'9').
de: Das Passwort muss mindestens eine Ziffer ('0'-'9') enthalten.

# MustHaveLowerCase
source: Passwords must have at least one lowercase ('a'-'z').
cs_cz: Heslo musí obsahovat alespoň jedno malé písmeno ('a'-'z').
de: Das Passwort muss mindestens einen Kleinbuchstaben ('a'-'z') enthalten.

# MustHaveUpperCase
source: Passwords must have at least one uppercase ('A'-'Z').
cs_cz: Heslo musí obsahovat alespoň jedno velké písmeno ('A'-'Z').
de: Das Passwort muss mindestens einen Grossbuchstaben ('A'-'Z') enthalten.

# ObjectModified
source: Optimistic concurrency failure, object has been modified.
cs_cz: Nastala chyba, objekt byl změněn.
de: Ein Fehler ist aufgetreten, das Objekt wurde geändert.

# PasswordAlreadySet
source: User already has a password set.
cs_cz: Uživatel už má nastavené heslo.
de: Der Benutzer hat bereits ein Passwort gesetzt.

# PasswordTooShort
source: Passwords must be at least {0} characters.
cs_cz: Heslo musí obsahovat alespoň {0} znaků.
de: Das Passwort muss mindestens {0} Zeichen lang sein.

# RoleInvalid
source: Role name {0} is invalid.
cs_cz: Jméno role {0} není platné.
de: Der Rollenname {0} ist ungültig.

# RoleNameTaken
source: Role name {0} is already taken.
cs_cz: Jméno role {0} je už použito.
de: Der Rollenname {0} wird bereits verwendet.

# UnknownFailure
source: An unknown failure has occurred.
cs_cz: Nastala neznámá chyba.
de: Ein unbekannter Fehler ist aufgetreten.

# UserInRole
source: User already in role {0}.
cs_cz: Uživatel už má přidělenou roli {0}.
de: Benutzer ist bereits zur Rolle {0} zugeordnet.

# UserNameTaken
source: User Name {0} is already taken.
cs_cz: Uživatelské jméno {0} už používá někdo jiný.
de: Der Benutzername {0} wird bereits verwendet.

# UserNameInvalid
source: User name {0} is invalid, can only contain letters or digits.
cs_cz: Uživatelské jméno {0} není platné, musí obsahovat pouze písmena a číslice.
de: Der Benutzername {0} ist ungültig, er darf nur Buchstaben oder Ziffern enthalten.

# UserNotInRole
source: User is not in role {0}.
cs_cz: Uživatel nemá přidělenou roli {0}.
de: Benutzer ist nicht zur Rolle {0} zugeordnet.

source: Recovery code redemption failed.
cs_cz: Uplatnění kódu pro obnovení se nezdařilo
de: Einlösung des Wiederherstellungscodes fehlgeschlagen.

# PasswordRequiresUniqueChars
source: Passwords must use at least {0} different characters.
cs_cz: Heslo musí obsahovat alespoň {0} různých znaků.
de: Das Passwort muss mindestens {0} verschiedene Zeichen enthalten.

source: Error
cs_cz: Chyba
de: Fehler

# Required
source: {0} is required
cs_cz: {0} je nutné vyplnit

# PasswordRequired
source: Password is required
cs_cz: Heslo musí být vyplněno
de: Passwort ist erforderlich

# UserNameRequired
source: User name is required
cs_cz: Uživatelské jméno musí být vyplněno
de: Benutzername ist erforderlich

# EmailRequired
source: Email is required
cs_cz: Email musí být vyplněn
de: Email ist erforderlich

# NameRequired
source: Name is required
cs_cz: Příjmení musí být vyplněno
de: Name ist erforderlich

# FirstNameRequired
source: First Name is required
cs_cz: Jméno musí být vyplněno
de: Vorname ist erforderlich

# TwoFactorCodeRequired
source: Two factor code is required
cs_cz: Kód pro dvoufaktorové přihlášení musí být vyplněn
de: Bestätigungscode ist erforderlich

source: Reset
cs_cz: Obnovit
de: Zurücksetzen

source: Sign in with Microsoft Account
cs_cz: Přihlášení přes Microsoft účet
de: Melden Sie sich mit Ihrem Microsoft-Konto an

source: Sign in with Google Account
cs_cz: Přihlášení přes Google účet
de: Melden Sie sich mit Ihrem Google-Konto an

source: Sign in with Azure AD
cs_cz: Přihlášení přes Azure AD
de: Melden Sie sich mit Ihrem Azure AD an

source: Continue Anyway
cs_cz: Přesto pokračovat
de: Trotzdem fortfahren

# BrowserNotCompatible
source: Your browser is not compatible with our application. Please install latest version of one of the browsers below:
cs_cz: Váš prohlížeč není kompatibilní s naší aplikací. Nainstalujte si prosím nejnovější verzi jednoho s těchto prohlížečů:
de: Ihr Browser ist nicht mit unserer Anwendung kompatibel. Bitte installieren Sie die neueste Version eines der folgenden Browser:

# ExcelExportForbidden
source: Export to excel is forbidden.
cs_cz: Export do excelu je zakázán.
de: Der Export nach Excel ist verboten.

source: Back
cs_cz: Zpět

source: Passwords don't match
cs_cz: Hesla nejsou stajná

# ErrorBlobNoData
source: Data source did not return any data.
cs_cz: Zdroj dat nevrátil žádná data.

# ToLogin3
source: to log in again.
de: um sich wieder anzumelden.

# ToResetPassword3
source: to reset your password.
de: um Ihr Passwort zurückzusetzen.

# ToInitialUser3
source: to create new user.
de: um einen neuen Benutzer anzulegen.

# ResetPasswordConfirmation3
source: to log in.
de: um sich anzumelden.

# EmailConfirmation3
source: to log in.
de: um sich anzumelden.
